Bjoerk92/Arduino-Modbus/Drivers/CHIP/Atmega328p/RegDef.h
/**
 * @file RegDef.h
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Atmega328p CPU register definitions
 * @version 0.1
 * @date 2025-12-31
 * 
 * @copyright Copyright (c) 2025
 * 
 */
#pragma once

#include <stdint.h>

/**
 * @typedef PINB
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port B input pins address.
 * 
 */
typedef union {
    uint8_t byte;               // Port B data register
    struct {
        uint8_t PINB0 : 1;      // Port B data bit 0
        uint8_t PINB1 : 1;      // Port B data bit 1
        uint8_t PINB2 : 1;      // Port B data bit 2
        uint8_t PINB3 : 1;      // Port B data bit 3
        uint8_t PINB4 : 1;      // Port B data bit 4
        uint8_t PINB5 : 1;      // Port B data bit 5
        uint8_t PINB6 : 1;      // Port B data bit 6
        uint8_t PINB7 : 1;      // Port B data bit 7
    }b;                         // Port B bit register
}PINB_t;

/**
 * @typedef DDRB
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port B data direction register address.
 * 
 */
typedef union {
    uint8_t byte;               // Port B Data Direction Register
    struct {
        uint8_t DDB0 : 1;       // Port B Data Direction Register bit 0
        uint8_t DDB1 : 1;       // Port B Data Direction Register bit 1
        uint8_t DDB2 : 1;       // Port B Data Direction Register bit 2
        uint8_t DDB3 : 1;       // Port B Data Direction Register bit 3
        uint8_t DDB4 : 1;       // Port B Data Direction Register bit 4
        uint8_t DDB5 : 1;       // Port B Data Direction Register bit 5
        uint8_t DDB6 : 1;       // Port B Data Direction Register bit 6
        uint8_t DDB7 : 1;       // Port B Data Direction Register bit 7
    }b;                         // Port B Data Direction Register bit register
}DDRB_t;

/**
 * @typedef PORTB
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port B data Register.
 * 
 */
typedef union {
    uint8_t byte;               // Port B Data Register
    struct {
        uint8_t PORTB0 : 1;     // Port B Data Register bit 0
        uint8_t PORTB1 : 1;     // Port B Data Register bit 1
        uint8_t PORTB2 : 1;     // Port B Data Register bit 2
        uint8_t PORTB3 : 1;     // Port B Data Register bit 3
        uint8_t PORTB4 : 1;     // Port B Data Register bit 4
        uint8_t PORTB5 : 1;     // Port B Data Register bit 5
        uint8_t PORTB6 : 1;     // Port B Data Register bit 6
        uint8_t PORTB7 : 1;     // Port B Data Register bit 7
    }b;                         // Port B Data Register bit register
}PORTB_t;

/**
 * @typedef PINC
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port C input pins address.
 * 
 */
typedef union {
    uint8_t byte;               // Port C Data Register
    struct {
        uint8_t PINC0 : 1;      // Port C Data Register bit 0
        uint8_t PINC1 : 1;      // Port C Data Register bit 1
        uint8_t PINC2 : 1;      // Port C Data Register bit 2
        uint8_t PINC3 : 1;      // Port C Data Register bit 3
        uint8_t PINC4 : 1;      // Port C Data Register bit 4
        uint8_t PINC5 : 1;      // Port C Data Register bit 5
        uint8_t PINC6 : 1;      // Port C Data Register bit 6
        uint8_t PINC7 : 1;      // Port C Data Register bit 7
    }b;                         // Port C Data Register bit register
}PINC_t;

/**
 * @typedef DDRC
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port C data direction register address.
 * 
 */
typedef union {
    uint8_t byte;               // Port C Data Direction Register
    struct {
        uint8_t DDC0 : 1;       // Port C Data Direction Register bit 0
        uint8_t DDC1 : 1;       // Port C Data Direction Register bit 1
        uint8_t DDC2 : 1;       // Port C Data Direction Register bit 2
        uint8_t DDC3 : 1;       // Port C Data Direction Register bit 3
        uint8_t DDC4 : 1;       // Port C Data Direction Register bit 4
        uint8_t DDC5 : 1;       // Port C Data Direction Register bit 5
        uint8_t DDC6 : 1;       // Port C Data Direction Register bit 6
        uint8_t DDC7 : 1;       // Port C Data Direction Register bit 7
    }b;                         // Port C Data Direction Register bit register
}DDRC_t;

/**
 * @typedef PORTC
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port C data Register.
 * 
 */
typedef union {
    uint8_t byte;               // Port C Data Register
    struct {
        uint8_t PORTC0 : 1;     // Port C Data Register bit 0
        uint8_t PORTC1 : 1;     // Port C Data Register bit 1
        uint8_t PORTC2 : 1;     // Port C Data Register bit 2
        uint8_t PORTC3 : 1;     // Port C Data Register bit 3
        uint8_t PORTC4 : 1;     // Port C Data Register bit 4
        uint8_t PORTC5 : 1;     // Port C Data Register bit 5
        uint8_t PORTC6 : 1;     // Port C Data Register bit 6
        uint8_t PORTC7 : 1;     // Port C Data Register bit 7
    }b;                         // Port C Data Register bit register
}PORTC_t;

/**
 * @typedef PIND
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port D input pins address.
 * 
 */
typedef union {
    uint8_t byte;               // Port D input pins
    struct {
        uint8_t PIND0 : 1;      // Port D input pins bit 0
        uint8_t PIND1 : 1;      // Port D input pins bit 1
        uint8_t PIND2 : 1;      // Port D input pins bit 2
        uint8_t PIND3 : 1;      // Port D input pins bit 3
        uint8_t PIND4 : 1;      // Port D input pins bit 4
        uint8_t PIND5 : 1;      // Port D input pins bit 5
        uint8_t PIND6 : 1;      // Port D input pins bit 6
        uint8_t PIND7 : 1;      // Port D input pins bit 7
    }b;                         // Port D input pins bit register
}PIND_t;

/**
 * @typedef DDRD
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port D data direction register address.
 * 
 */
typedef union {
    uint8_t byte;               // Port D Data Direction Register
    struct {
        uint8_t DDD0 : 1;       // Port D Data Direction Register bit 0
        uint8_t DDD1 : 1;       // Port D Data Direction Register bit 1
        uint8_t DDD2 : 1;       // Port D Data Direction Register bit 2
        uint8_t DDD3 : 1;       // Port D Data Direction Register bit 3
        uint8_t DDD4 : 1;       // Port D Data Direction Register bit 4
        uint8_t DDD5 : 1;       // Port D Data Direction Register bit 5
        uint8_t DDD6 : 1;       // Port D Data Direction Register bit 6
        uint8_t DDD7 : 1;       // Port D Data Direction Register bit 7
    }b;                         // Port D Data Direction Register bit register
}DDRD_t;

/**
 * @typedef PORTD
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Port D data Register.
 * 
 */
typedef union {
    uint8_t byte;               // Port D data Register
    struct {
        uint8_t PORTD0 : 1;     // Port D data Register bit 0
        uint8_t PORTD1 : 1;     // Port D data Register bit 1
        uint8_t PORTD2 : 1;     // Port D data Register bit 2
        uint8_t PORTD3 : 1;     // Port D data Register bit 3
        uint8_t PORTD4 : 1;     // Port D data Register bit 4
        uint8_t PORTD5 : 1;     // Port D data Register bit 5
        uint8_t PORTD6 : 1;     // Port D data Register bit 6
        uint8_t PORTD7 : 1;     // Port D data Register bit 7
    }b;                         // Port D data Register bit register
}PORTD_t;

/**
 * @typedef TIFR0
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 0 Interrupt Flag Register
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 0 Interrupt Flag Register
    struct {
        uint8_t TOV0 : 1;       // Timer/Counter 0 Overflow Flag
        uint8_t OCF0A : 1;      // Timer/Counter 0 Output Compare Flag A
        uint8_t OCF0B : 1;      // Timer/Counter 0 Output Compare Flag B3
        uint8_t align : 5;      // alignment - unused
    }b;
}TIFR0_t;

/**
 * @typedef TIFR1
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Interrupt Flag Register
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 1 Interrupt Flag Register
    struct {
        uint8_t TOV1 : 1;       // Timer/Counter 1 Overflow Flag
        uint8_t OCF1A : 1;      // Timer/Counter 1 Output Compare Flag A
        uint8_t OCF1B : 1;      // Timer/Counter 1 Output Compare Flag B
        uint8_t reserved : 2;   // reserved/unused
        uint8_t ICF1 : 1;       // Timer/Counter Input Capture Flag 1
        uint8_t align : 2;      // alignment - unused
    }b;
}TIFR1_t;

/**
 * @typedef TIFR2
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 2 Interrupt Flag Register
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 2 Interrupt Flag Register
    struct {
        uint8_t TOV2 : 1;       // Timer/Counter 2 Overflow Flag
        uint8_t OCF2A : 1;      // Timer/Counter 2 Output Compare Flag A
        uint8_t OCF2B : 1;      // Timer/Counter 2 Output Compare Flag B3
        uint8_t align : 5;      // alignment - unused
    }b;
}TIFR2_t;

/**
 * @typedef PCIFR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Pin Change Interrupt Flag Register
 * 
 */
typedef union {
    uint8_t byte;               // Pin Change Interrupt Flag Register
    struct {
        uint8_t PCIF0 : 1;      // Pin Change Interrupt Flag Register bit 0
        uint8_t PCIF1 : 1;      // Pin Change Interrupt Flag Register bit 1
        uint8_t PCIF2 : 1;      // Pin Change Interrupt Flag Register bit 2
        uint8_t align : 5;      // alignment - unused
    }b;
}PCIFR_t;

/**
 * @typedef EIFR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief External Interrupt Flag Register
 * 
 */
typedef union {
    uint8_t byte;               // External Interrupt Flag Register
    struct {
        uint8_t INTF0 : 1;      // External Interrupt Flag Register bit 0
        uint8_t INTF1 : 1;      // External Interrupt Flag Register bit 1
        uint8_t align : 6;      // alignment - unused
    }b;
}EIFR_t;

/**
 * @typedef EIMSK
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief External Interrupt Mask Register
 * 
 */
typedef union {
    uint8_t byte;               // External Interrupt Mask Register
    struct {
        uint8_t INT0 : 1;       // External Interrupt Mask Register bit 0
        uint8_t INT1 : 1;       // External Interrupt Mask Register bit 1
        uint8_t align : 6;      // alignment - unused
    }b;
}EIMSK_t;

/**
 * @typedef GPIOR0
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief General Purpose I/O register
 * 
 */
typedef union {
    uint8_t byte;               // General Purpose I/O register
    struct {
        uint8_t GPIOR0_0 : 1;       // I/O pin 0
        uint8_t GPIOR0_1 : 1;       // I/O pin 1
        uint8_t GPIOR0_2 : 1;       // I/O pin 2
        uint8_t GPIOR0_3 : 1;       // I/O pin 3
        uint8_t GPIOR0_4 : 1;       // I/O pin 4
        uint8_t GPIOR0_5 : 1;       // I/O pin 5
        uint8_t GPIOR0_6 : 1;       // I/O pin 6
        uint8_t GPIOR0_7 : 1;       // I/O pin 7
    }b;
}GPIOR0_t;

/**
 * @typedef EECR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief The Eeprom control register
 * 
 */
typedef union {
    uint8_t byte;               // The Eeprom control register
    struct {
        uint8_t EERE : 1;       // Eeprom Read Enable
        uint8_t EEPE : 1;       // Eeprom Program Enable
        uint8_t EEMPE : 1;      // Eeprom Memory Page Erase Enable
        uint8_t EERIE : 1;      // Eeprom Ready Interrupt Enable
        uint8_t align : 4;      // alignment - unused
    }b;
}EECR_t;

/**
 * @typedef EEAR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Thhe Eeprom Address register
 * 
 */
typedef union {
    uint16_t address;           // Eeprom Address register
    struct {
        uint8_t Low;            // Eeprom Address register Low side
        uint8_t High;           // Eeprom Address register High side
    }us;
}EEAR_t;

/**
 * @typedef GTCCR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief General Timer/Counter Control Register
 * 
 */
typedef union {
    uint8_t byte;               // General Timer/Counter Control Register
    struct {
        uint8_t PSRSYNC : 1;    // Prescaler Reset Timer/counter 0/1
        uint8_t PSRASY  : 1;    // Prescaler Timer/counter 2
        uint8_t reserved : 5;   // Reserved
        uint8_t TSM : 1;        // Timer/Counter Synchronization Mode
    }b;
}GTCCR_t;

/**
 * @typedef TCCR0A
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 0 Control Register A
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter Control Register A
    struct {
        uint8_t WGM : 2;        // Waveform Generation Mode 0/1 
        uint8_t reserved : 2;   // Reserved
        uint8_t COM0B0: 1;      // Compare Output Mode 0B
        uint8_t COM0B1: 1;      // Compare Output Mode 0B
        uint8_t COM0A0: 1;      // Compare Output Mode 0A
        uint8_t COM0A1: 1;      // Compare Output Mode 0A
    }b;
}TCCR0A_t;

/**
 * @typedef TCCR0B
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 0 Control Register B
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter Control Register B
    struct {
        uint8_t CS : 3;         // Clock Select
        uint8_t WGM : 1;        // Wave generator mode 2 - used with WGM in TCCR0A!
        uint8_t reserved : 2;   // Reserved
        uint8_t FOC0B : 1;      // Force Output Compare B
        uint8_t FOC0A : 1;      // Force Output Compare A
    }b;
}TCCR0B_t;

/**
 * @typedef GPIOR1
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief General Purpose I/O register 1
 * 
 */
typedef union {
    uint8_t byte;               // General Purpose I/O register 1
    struct {
        uint8_t GPIOR1_0 : 1;   // General Purpose I/O register 1 bit 0
        uint8_t GPIOR1_1 : 1;   // General Purpose I/O register 1 bit 1
        uint8_t GPIOR1_2 : 1;   // General Purpose I/O register 1 bit 2
        uint8_t GPIOR1_3 : 1;   // General Purpose I/O register 1 bit 3
        uint8_t GPIOR1_4 : 1;   // General Purpose I/O register 1 bit 4
        uint8_t GPIOR1_5 : 1;   // General Purpose I/O register 1 bit 5
        uint8_t GPIOR1_6 : 1;   // General Purpose I/O register 1 bit 6
        uint8_t GPIOR1_7 : 1;   // General Purpose I/O register 1 bit 7
    }b;                         
}GPIOR1_t;

/**
 * @typedef GPIOR2
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief General Purpose I/O register 2
 * 
 */
typedef union {
    uint8_t byte;               // General Purpose I/O register 2
    struct {
        uint8_t GPIOR2_0 : 1;   // General Purpose I/O register 2 bit 0
        uint8_t GPIOR2_1 : 1;   // General Purpose I/O register 2 bit 1
        uint8_t GPIOR2_2 : 1;   // General Purpose I/O register 2 bit 2
        uint8_t GPIOR2_3 : 1;   // General Purpose I/O register 2 bit 3
        uint8_t GPIOR2_4 : 1;   // General Purpose I/O register 2 bit 4
        uint8_t GPIOR2_5 : 1;   // General Purpose I/O register 2 bit 5
        uint8_t GPIOR2_6 : 1;   // General Purpose I/O register 2 bit 6
        uint8_t GPIOR2_7 : 1;   // General Purpose I/O register 2 bit 7
    }b;                         
}GPIOR2_t;


/**
 * @typedef SPCR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief SPI Control register
 * 
 */
typedef union {
    uint8_t byte;               // SPI Control register
    struct {
        uint8_t SPR0 : 2;       // SPI Clock select 
        uint8_t CPHA : 1;       // Clock Phase
        uint8_t CPOL : 1;       // Clock Polarity
        uint8_t MSTR : 1;       // Master Selection
        uint8_t DORD : 1;       // Data Order
        uint8_t SPE : 1;        // SPI Enable
        uint8_t SPIE : 1;       // SPI Interrupt Enable
    }b;
}SPCR_t;

/**
 * @typedef SPSR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief SPI Status register
 * 
 */
typedef union {
    uint8_t byte;               // SPI Status register
    struct {
        uint8_t SPI2X : 1;      // Double SPI Speed
        uint8_t reserved : 5;   // Reserved
        uint8_t WCOL : 1;       // Write Collision Flag
        uint8_t SPIF : 1;       // SPI Interrupt Flag
    }b;
}SPSR_t;

/**
 * @typedef ACSR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Analog Comparator Control and Status Register
 * 
 */
typedef union  {
    uint8_t byte;               // Analog Comparator Control and Status Register
    struct {
        uint8_t ACIS : 2;       // Analog Comparator Interrupt Mode Select bits
        uint8_t ACIC : 1;       // Analog Comparator Input Capture Enable
        uint8_t ACIE : 1;       // Analog Comparator Interrupt Enable
        uint8_t ACI : 1;        // Analog Comparator Interrupt Flag
        uint8_t ACO : 1;        // Analog Compare Output
        uint8_t ACBG : 1;       // Analog Comparator Bandgap Select
        uint8_t ACD : 1;        // Analog Comparator Disable
    }b;
}ACSR_t;

/**
 * @typedef SMCR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Sleep mode Control register
 * 
 */
typedef union {
    uint8_t byte;               // Sleep mode Control register
    struct {
        uint8_t SE : 1;         // Sleep Enable
        uint8_t SM : 3;         // Sleep Mode
        uint8_t reserved : 4;   // Reserved
    }b; 
}SMCR_t;

/**
 * @typedef MCUSR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief MCU Status Register
 * 
 */
typedef union {
    uint8_t byte;               // MCU Status Register
    struct {
        uint8_t PORF : 1;       // Power-on reset flag
        uint8_t EXTRF : 1;      // External Reset Flag
        uint8_t BORF : 1;       // Brown-out Reset Flag
        uint8_t WDRF : 1;       // Watchdog Reset Flag
        uint8_t reserved : 4;   // Reserved
    }b;
}MCUSR_t;

/**
 * @typedef MCUCR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief MCU Control Register
 * 
 */
typedef union {
    uint8_t byte;               // MCU Control Register
    struct {
        uint8_t IVCE : 1;       // Interrupt Vector Change Enable
        uint8_t IVSEL : 1;      // Interrupt Vector Select
        uint8_t reserved : 2;   // Reserved
        uint8_t PUD : 1;        // Pull-up Disable  Read only
        uint8_t BODSE : 1;      // BOD Sleep Enable Read only
        uint8_t BODS : 1;       // BOD Sleep        Read only
        uint8_t align : 1;      // alignment
    }b;
}MCUCR_t;

