Bjoerk92/Arduino-Modbus/Drivers/CHIP/Atmega328p/RegDef.h
typedef union {
    uint8_t byte;               // Store Program Memory Control and Status Register
    struct {
        uint8_t SELFPRGEN : 1;  // Self-Programming Enable
        uint8_t PGERS : 1;      // Page Erase Status
        uint8_t PGWRT : 1;      // Page Write Status
        uint8_t BLBSET : 1;     // Boot Lock Bits Set
        uint8_t RWWSRE : 1;     // Read While Write section read enable
        uint8_t reserved : 1;   // Reserved
        uint8_t RWWSB : 1;      // Read While Write Section Busy
        uint8_t SPMIE : 1;      // SPM Interrupt Enable
    }b;
}SPMCSR_t;

/**
 * @typedef SP
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Stack Pointer register (SPL, SPH)
 * 
 */
typedef union {
    uint16_t Sp;                // stack pointer 
    struct {
        uint8_t SPL : 8;        // stack pointer low byte
        uint8_t SPH : 8;        // stack pointer high byte
    }byte;
}SP_t;

/**
 * @typedef SREG
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief AVR status register
 * 
 */
typedef union {
    uint8_t byte;               // AVR status register
    struct {
        uint8_t C : 1;          // Carry flag
        uint8_t Z : 1;          // Zero Flag
        uint8_t N : 1;          // Negative Flag
        uint8_t V : 1;          // Two's Complement Overflow Flag
        uint8_t S : 1;          // Sign Flag
        uint8_t H : 1;          // Half Carry Flag
        uint8_t T : 1;          // Transfer Bit
        uint8_t I : 1;          // Interrupt Flag
    }b;
}SREG_t;

/**
 * @typedef WDTCSR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Watchdog Timer Control Register
 * 
 */
typedef union {
    uint8_t byte;               // Watchdog Timer Control Register
    struct {
        uint8_t WDP : 3;        // Watchdog Timer Prescaler 0-2
        uint8_t WDE : 1;        // Watchdog System Reset Enable
        uint8_t WDCE : 1;       // Watchdog Change Enable
        uint8_t WDP3 : 1;       // Watchdog Timer Prescaler Bit 3
        uint8_t WDIE : 1;       // Watchdog Interrupt Enable
        uint8_t WDIF : 1;       // Watchdog Interrupt Flag
    }b;
}WDTCSR_t;

/**
 * @typedef CLKPR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Clock Prescaler Register
 * 
 */
typedef union {
    uint8_t byte;               // Clock Prescale Register
    struct {
        uint8_t CKSEL : 4;      // Clock Prescaler Select Bits
        uint8_t reserved : 3;   // Reserved
        uint8_t CLKPCE : 1;     // Clock Prescaler Change Enable
    }b;
}CLKPR_t;

/**
 * @typedef PRR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Power Reduction Register
 * 
 */
typedef union {
    uint8_t byte;               // Power Reduction Register
    struct {
        uint8_t PRADC : 1;      // Power Reduction ADC
        uint8_t PRUSART0 : 1;   // Power Reduction USART0
        uint8_t PRSPI : 1;      // Power Reduction Serial Peripheral Interface
        uint8_t PRTIM1 : 1;     // Power Reduction Timer/Counter1
        uint8_t reserved : 1;   // Reserved
        uint8_t PRTIM0 : 1;     // Power Reduction Timer/Counter0
        uint8_t PRTIM2 : 1;     // Power Reduction Timer/Counter2
        uint8_t PTRWI : 1;      // Power Reduction TWI
    }b;
}PRR_t;

/**
 * @typedef PCICR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Pin Change Interrupt Control Register
 * 
 */
typedef union {
    uint8_t byte;               // Pin Change Interrupt Control Register
    struct {
        uint8_t PCIE0 : 1;      // Pin Change Interrupt Enable 0
        uint8_t PCIE1 : 1;      // Pin Change Interrupt Enable 1
        uint8_t PCIE2 : 1;      // Pin Change Interrupt Enable 2
        uint8_t align : 5;      // alignment - unused
    }b;
}PCICR_t;

/**
 * @typedef EICRA
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief External Interrupt Control Register A
 * 
 */
typedef union {
    uint8_t byte;               // External Interrupt Control Register A
    struct {
        uint8_t ISC00 : 1;      // External Interrupt Sense Control 0 Bit 0
        uint8_t ISC01 : 1;      // External Interrupt Sense Control 0 Bit 1
        uint8_t ISC10 : 1;      // External Interrupt Sense Control 1 Bit 0
        uint8_t ISC11 : 1;      // External Interrupt Sense Control 1 Bit 1
        uint8_t align : 4;      // alignment - unused
    }b;
}EICRA_t;

/**
 * @typedef PCMSK0
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Pin Change Mask Register 0
 * 
 */
typedef union {
    uint8_t byte;               // Pin Change Mask Register 0
    struct {
        uint8_t PCINT0 : 1;     // Pin Change Enable Mask 0
        uint8_t PCINT1 : 1;     // Pin Change Enable Mask 1
        uint8_t PCINT2 : 1;     // Pin Change Enable Mask 2
        uint8_t PCINT3 : 1;     // Pin Change Enable Mask 3
        uint8_t PCINT4 : 1;     // Pin Change Enable Mask 4
        uint8_t PCINT5 : 1;     // Pin Change Enable Mask 5
        uint8_t PCINT6 : 1;     // Pin Change Enable Mask 6
        uint8_t PCINT7 : 1;     // Pin Change Enable Mask 7
    }b;
}PCMSK0_t;

/**
 * @typedef PCMSK1
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Pin Change Mask Register 1
 * 
 */
typedef union {
    uint8_t byte;               // Pin Change Mask Register 1
    struct {
        uint8_t PCINT8 : 1;     // Pin Change Enable Mask 8
        uint8_t PCINT9 : 1;     // Pin Change Enable Mask 9
        uint8_t PCINT10 : 1;    // Pin Change Enable Mask 10
        uint8_t PCINT11 : 1;    // Pin Change Enable Mask 11
        uint8_t PCINT12 : 1;    // Pin Change Enable Mask 12
        uint8_t PCINT13 : 1;    // Pin Change Enable Mask 13
        uint8_t PCINT14 : 1;    // Pin Change Enable Mask 14
        uint8_t align : 1;      // alignement - unused
    }b;
}PCMSK1_t;


typedef union {
    uint8_t byte;               // Pin Change Mask Register 2
    struct
    {
        uint8_t PCINT16 : 1;    // Pin Change Enable Mask 16
        uint8_t PCINT17 : 1;    // Pin Change Enable Mask 17
        uint8_t PCINT18 : 1;    // Pin Change Enable Mask 18
        uint8_t PCINT19 : 1;    // Pin Change Enable Mask 19
        uint8_t PCINT20 : 1;    // Pin Change Enable Mask 20
        uint8_t PCINT21 : 1;    // Pin Change Enable Mask 21
        uint8_t PCINT22 : 1;    // Pin Change Enable Mask 22
        uint8_t PCINT23 : 1;    // Pin Change Enable Mask 23
    }b;
}PCMSK2_t;

/**
 * @typedef TIMSK0
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 0 Interrupt Mask Register
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 0 Interrupt Mask Register
    struct {
        uint8_t TOIE0 : 1;      // Timer/Counter 0 Interrupt Enable
        uint8_t OCIE0A : 1;     // Timer/Counter 0 Output Compare A Interrupt Enable
        uint8_t OCIE0B : 1;     // Timer/Counter 0 Output Compare B Interrupt Enable
        uint8_t align : 5;      // alignment - unused
    }b;
}TIMSK0_t;


