Bjoerk92/Arduino-Modbus/Drivers/CHIP/Atmega328p/RegDef.h
typedef union {
    uint8_t byte;               // Timer/Counter 1 Interrupt Mask Register 
    struct {
        uint8_t TOIE1 : 1;      // Timer/Counter 1 Interrupt Enable
        uint8_t OCIE1A : 1;     // Timer/Counter 1 Output Compare A Interrupt Enable
        uint8_t OCIE1B : 1;     // Timer/Counter 1 Output Compare B Interrupt Enable
        uint8_t reserved : 2;   // reserved/unused
        uint8_t ICIE1 : 1;      // Timer/Counter 1 Input Capture Interrupt Enable
        uint8_t align : 2;      // alignment - unused
    }b;
}TIMSK1_t;

/**
 * @typedef TIMSK2
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 2 Interrupt Mask Register
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 2 Interrupt Mask Register
    struct {
        uint8_t TOIE2 : 1;      // Timer/Counter 2 Interrupt Enable
        uint8_t OCIE2A : 1;     // Timer/Counter 2 Output Compare A Interrupt Enable
        uint8_t OCIE2B : 1;     // Timer/Counter 2 Output Compare B Interrupt Enable
        uint8_t align : 5;      // alignment - unused
    }b;
}TIMSK2_t;

/**
 * @typedef ADC
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief ADC Data register
 * 
 */
typedef union {
    uint16_t ADC;               // ADC Data Register
    struct {
        uint16_t ADCL : 8;      // ADC Data Register low byte
        uint16_t ADCH : 8;      // ADC Data Register high byte
    }b;
}ADC_t;

/**
 * @typedef ADCSRA
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief ADC Control and Status Register A
 * 
 */
typedef union {
    uint8_t byte;               // ADC Control and Status Register A
    struct {
        uint8_t ADPS : 3;       // ADC Prescaler Select bits
        uint8_t ADIE : 1;       // ADC Interrupt Enable
        uint8_t ADIF : 1;       // ADC Interrupt Flag
        uint8_t ADATE : 1;      // ADC Auto Trigger Enable
        uint8_t ADSC : 1;       // ADC Start Conversion
        uint8_t ADEN : 1;       // ADC Enable
    }b;
}ADCSRA_t;

/**
 * @typedef ADCSRB
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief ADC Control and Status Register B
 * 
 */
typedef union {
    uint8_t byte;               // ADC Control and Status Register B
    struct {
        uint8_t ADTS : 3;       // ADC Auto Trigger Source bits
        uint8_t reserved : 3;   // Reserved
        uint8_t ACME : 1;       // Analog Comparator Multiplexer Enable
    }b;
}ADCSRB_t;

/**
 * @typedef ADMUX
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief ADC Multiplexer Selection Register
 * 
 */
typedef union {
    uint8_t byte;               // ADC Multiplexer Selection Register
    struct {
        uint8_t MUX : 4;        // ADC Channel Selection bits
        uint8_t reserved : 1;   // Reserved
        uint8_t ADLAR : 1;      // ADC Left Adjust Result
        uint8_t REFS : 2;       // Reference Selection bits
    }b;
}ADMUX_t;

/**
 * @typedef DIDR0
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Digital Input Disable Register 0
 * 
 */
typedef union {
    uint8_t byte;               // Digital Input Disable Register 0
    struct {
        uint8_t ADC0D : 1;      // ADC0 Digital Input Disable
        uint8_t ADC1D : 1;      // ADC1 Digital Input Disable
        uint8_t ADC2D : 1;      // ADC2 Digital Input Disable
        uint8_t ADC3D : 1;      // ADC3 Digital Input Disable
        uint8_t ADC4D : 1;      // ADC4 Digital Input Disable
        uint8_t ADC5D : 1;      // ADC5 Digital Input Disable
        uint8_t align : 2;      // alignment - unused
    }b;
}DIDR0_t;

/**
 * @typedef DIDR1
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Digital Input Disable Register 1
 * 
 */
typedef union {
    uint8_t byte;               // Digital Input Disable Register 1
    struct {
        uint8_t AIN0D : 1;      // AIN0 Digital Input Disable
        uint8_t AIN1D : 1;      // AIN1 Digital Input Disable
        uint8_t align : 6;      // alignment - unused
    }b;
}DIDR1_t;

/**
 * @typedef TCCR1A
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Control Register A
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 1 Control Register A
    struct {
        uint8_t WGM : 2;        // Waveform Generation Mode 0/1 
        uint8_t reserved : 2;   // Reserved
        uint8_t COM1B0: 1;      // Compare Output Mode 0B
        uint8_t COM1B1: 1;      // Compare Output Mode 0B
        uint8_t COM1A0: 1;      // Compare Output Mode 0A
        uint8_t COM1A1: 1;      // Compare Output Mode 0A
    }b;
}TCCR1A_t;

/**
 * @typedef TCCR1B
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Control Register B
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 1 Control Register B
    struct {
        uint8_t CS : 3;         // Clock Select bits
        uint8_t WGM1x : 2;      // Wave generator mode 2 - used with WGM in TCCR1A!
        uint8_t reserved : 1;   // Reserved
        uint8_t ICES1 : 1;      // Input Capture 1 Edge Select
        uint8_t ICNC1 : 1;      // Input Capture 1 Noise Canceler
    }b;
}TCCR1B_t;

/**
 * @typedef TCCR1C
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Control Register C
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 1 Control Register C
    struct {
        uint8_t reserved : 6;   // Reserved
        uint8_t FOC1B : 1;      // Force Output Compare 1B
        uint8_t FOC1A : 1;      // Force Output Compare 1A
    }b;
}TCCR1C_t;

/**
 * @typedef TCNT1
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Counter register
 * 
 */
typedef union {
    uint16_t TCNT1;             // Timer/Counter 1 Counter register
    struct {
        uint16_t TCNT1L : 8;    // Timer/Counter 1 low byte
        uint16_t TCNT1H : 8;    // Timer/Counter 1 high byte
    }b;
}TCNT1_t;

/**
 * @typedef ICR1
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Input Capture Register
 * 
 */
typedef union {
    uint16_t ICR1;              // Timer/Counter 1 Input Capture Register
    struct {
        uint16_t ICR1L : 8;     // Timer/Counter 1 Input Capture Register low byte
        uint16_t ICR1H : 8;     // Timer/Counter 1 Input Capture Register high byte
    }b;
}ICR1_t;

/**
 * @typedef OCR1A
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Output Compare Register A
 * 
 */
typedef union {
    uint16_t OCR1A;             // Timer/Counter 1 Output Compare Register A
    struct {
        uint16_t OCR1AL : 8;    // Timer/Counter 1 Output Compare Register A low byte
        uint16_t OCR1AH : 8;    // Timer/Counter 1 Output Compare Register A high byte
    }b;
}OCR1A_t;

/**
 * @typedef OCR1B
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 1 Output Compare Register B
 * 
 */
typedef union {
    uint16_t OCR1B;             // Timer/Counter 1 Output Compare Register B
    struct {
        uint16_t OCR1BL : 8;    // Timer/Counter 1 Output Compare Register B low byte
        uint16_t OCR1BH : 8;    // Timer/Counter 1 Output Compare Register B high byte
    }b;
}OCR1B_t;

/**
 * @typedef TCCR2A
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counter 2 Control Register 2
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 2 Control Register 2
    struct {
        uint8_t WGM2x : 2;      // Waveform Generation Mode 2
        uint8_t reserved : 2;   // Reserved
        uint8_t COM2B0 : 1;     // Compare Output Mode 2B
        uint8_t COM2B1 : 1;     // Compare Output Mode 2B
        uint8_t COM2A0 : 1;     // Compare Output Mode 2A
        uint8_t COM2A1 : 1;     // Compare Output Mode 2A
    }b;
}TCCR2A_t;

/**
 * @typedef TCCR2B
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Timer/Counert 2 Control Register 2
 * 
 */
typedef union {
    uint8_t byte;               // Timer/Counter 2 Control Register 2
    struct {
        uint8_t CS : 3;         // Clock Select bits
        uint8_t WGM2x : 1;      // Waveform Generation Mode 2
        uint8_t reserved : 2;   // Reserved
        uint8_t FOC2B : 1;      // Input Capture 2 Edge Select
        uint8_t FOC2A : 1;      // Input Capture 2 Noise Canceler
    }b;
}TCCR2B_t;

/**
 * @typedef ASSR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief Assynchronous Status Register
 * 
 */
typedef union {
    uint8_t byte;               // Asynchronous Status Register
    struct {
        uint8_t TCR2BUB : 1;    // Timer/Counter Control Register 2 B update busy
        uint8_t TCR2AUB : 1;    // Timer/Counter Control Register 2 A update busy
        uint8_t OCR2BUB : 1;    // Output Compare Register 2 B update busy
        uint8_t OCR2AUB : 1;    // Output Compare Register 2 A update busy
        uint8_t TCN2UB : 1;     // Timer/Counter 2 update busy
        uint8_t AS2 : 1;        // Asynchronous Timer/Counter 2
        uint8_t EXCLK : 1;      // External Clock Source
        uint8_t reserved : 1;   // Reserved
    }b;
}ASSR_t;

/**
 * @typedef TWSR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief TWI Status Register
 * 
 */
typedef union {
    uint8_t byte;               // TWI Status Register
    struct {
        uint8_t TWPS : 2;       // TWI Prescaler
        uint8_t reserved : 1;   // Reserved
        uint8_t TWS : 5;        // TWI Status
    }b;
}TWSR_t;

/**
 * @typedef TWAR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief TWI Status register
 * 
 */
typedef union {
    uint8_t byte;               // TWI_Status Register
    struct {
        uint8_t TWGCE : 1;      // TWI General Call Recognition Enable
        uint8_t TWA : 7;        // TWI Address
    }b;
}TWAR_t;

/**
 * @brief TWCR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief TWI Control Register
 * 
 */
typedef union {
    uint8_t byte;               // TWI Control Register
    struct {
        uint8_t TWIE : 1;       // TWI Interrupt Enable
        uint8_t reserved : 1;   // Reserved
        uint8_t TWEN : 1;       // TWI Enable
        uint8_t TWWC : 1;       // TWI Write Collision Flag
        uint8_t TWSTO : 1;      // TWI Stop Condition Flag
        uint8_t TWSTA : 1;      // TWI Start Condition Flag
        uint8_t TWEA : 1;       // TWI Enable Acknowledge
        uint8_t TWINT : 1;      // TWI Interrupt Flag
    }b;
}TWCR_t;

/**
 * @typedef TWAMR
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief TWI Address mask register
 * 
 */
typedef union {
    uint8_t byte;               // TWI Address Mask Register
    struct {
        uint8_t reserved : 1;   // Reserved
        uint8_t TWAM : 7;       // TWI Address Mask
    }b;
}TWAMR_t;

/**
 * @typedef UCSR0A
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief USART Control and Status Register 0 A
 * 
 */
typedef union {
    uint8_t byte;               // USART COntrol and Status Register 0 A
    struct {
        uint8_t MPCM : 1;       // Multi-processor Communication Mode
        uint8_t U2X : 1;        // Double the USART transmission speed
        uint8_t UPE : 1;        // USART Parity Error
        uint8_t DOR : 1;        // Data Overrun
        uint8_t FE : 1;         // Framing Error
        uint8_t UDRE : 1;       // USART Data Register Empty
        uint8_t TXC : 1;        // USART Transmit Complete
        uint8_t RXC : 1;        // USART Receive Complete
    }b;
}UCSR0A_t;

/**
 * @typedef UCSR0B
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief USART Control and Status Register 0 B
 * 
 */
typedef union {
    uint8_t byte;               // USART Control and Status Register 0 B
    struct {
        uint8_t RXCIE : 1;      // RX Complete Interrupt Enable
        uint8_t TXCIE : 1;      // TX Complete Interrupt Enable
        uint8_t UDRIE : 1;      // USART Data Register Empty Interrupt Enable
        uint8_t RXEN : 1;       // Receiver Enable
        uint8_t TXEN : 1;       // Transmitter Enable
        uint8_t UCSZ : 2;       // Character Size
        uint8_t UMSEL : 1;      // USART Mode Select
        uint8_t UPM : 2;        // Parity Mode
    }b;
}UCSR0B_t;

/**
 * @typedef UCSR0C
 * @author Anders Bjørk (anders.bjoerk.unf@gmail.com)
 * @brief USART Control and Status Register 0 C
 * 
 */
typedef union {
    uint8_t byte;               // USART Control and Status Register 0 C
    struct {
        uint8_t UCPOL : 1;      // Clock Polarity
        uint8_t UCSZ : 2;       // Character Size
        uint8_t USBS : 1;       // Stop Bit Select
        uint8_t UPM : 2;        // Parity Mode
        uint8_t UMSEL : 1;      // USART Mode Select
    }b;
}UCSR0C_t;


typedef union {
    uint16_t UBRR0;             // USART Baud Rate Register 0
    struct {
        uint16_t UBRR0L : 8;    // USART Baud Rate Register 0 low byte
        uint16_t UBRR0H : 8;    // USART Baud Rate Register 0 high byte
    }b;
}UBRR0_t;